Script started on 2023-12-04 16:45:17-08:00 [TERM="xterm-256color" TTY="/dev/pts/1" COLUMNS="80" LINES="24"]
[?2004h]0;jdizzle@jdizzle-vbuntu: ~/CS497/CS497/Assignment-8[01;32mjdizzle@jdizzle-vbuntu[00m:[01;34m~/CS497/CS497/Assignment-8[00m$ file assi[K[K[Kpplication 
[?2004lapplication: ELF 64-bit LSB pie executable, x86-64, version 1 (SYSV), dynamically linked, interpreter /lib64/ld-linux-x86-64.so.2, BuildID[sha1]=0d6cd755931e7d576c001ef1315329c3a48f5904, for GNU/Linux 3.2.0, with debug_info, not stripped
[?2004h]0;jdizzle@jdizzle-vbuntu: ~/CS497/CS497/Assignment-8[01;32mjdizzle@jdizzle-vbuntu[00m:[01;34m~/CS497/CS497/Assignment-8[00m$ strings --help
[?2004lUsage: strings [option(s)] [file(s)]
 Display printable strings in [file(s)] (stdin by default)
 The options are:
  -a - --all                Scan the entire file, not just the data section [default]
  -d --data                 Only scan the data sections in the file
  -f --print-file-name      Print the name of the file before each string
  -n <number>               Locate & print any sequence of at least <number>
    --bytes=<number>         displayable characters.  (The default is 4).
  -t --radix={o,d,x}        Print the location of the string in base 8, 10 or 16
  -w --include-all-whitespace Include all whitespace as valid string characters
  -o                        An alias for --radix=o
  -T --target=<BFDNAME>     Specify the binary file format

  DW_CFA_def_cfa: r7 (rsp) ofs 8
  DW_CFA_nop

000000c4 ZERO terminator


Contents of the .debug_aranges section (loaded from application):

  Length:                   44
  Version:                  2
  Offset into .debug_info:  0x0
  Pointer Size:             8
  Segment Size:             0

    Address            Length
    00000000000013c9 00000000000003b6 
    0000000000000000 0000000000000000 

Contents of the .debug_info section (loaded from application):

  Compilation Unit @ offset 0x0:
   Length:        0x809 (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  8
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x34): GNU C17 11.4.0 -mtune=generic -march=x86-64 -g -gdwarf-4 -fasynchronous-unwind-tables -fstack-protector-strong -fstack-clash-protection -fcf-protection
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x3dd): application.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0x391): /home/jdizzle/CS497/CS497/Assignment-8
    <19>   DW_AT_low_pc      : 0x13c9
    <21>   DW_AT_high_pc     : 0x3b6
    <29>   DW_AT_stmt_list   : 0x0
 <1><2d>: Abbrev Number: 2 (DW_TAG_typedef)
    <2e>   DW_AT_name        : (indirect string, offset: 0x14c): size_t
    <32>   DW_AT_decl_file   : 2
    <33>   DW_AT_decl_line   : 209
    <34>   DW_AT_decl_column : 23
    <35>   DW_AT_type        : <0x39>
 <1><39>: Abbrev Number: 3 (DW_TAG_base_type)
    <3a>   DW_AT_byte_size   : 8
    <3b>   DW_AT_encoding    : 7	(unsigned)
    <3c>   DW_AT_name        : (indirect string, offset: 0x103): long unsigned int
 <1><40>: Abbrev Number: 3 (DW_TAG_base_type)
    <41>   DW_AT_byte_size   : 4
    <42>   DW_AT_encoding    : 7	(unsigned)
    <43>   DW_AT_name        : (indirect string, offset: 0x108): unsigned int
 <1><47>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <48>   DW_AT_byte_size   : 8
 <1><49>: Abbrev Number: 3 (DW_TAG_base_type)
    <4a>   DW_AT_byte_size   : 1
    <4b>   DW_AT_encoding    : 8	(unsigned char)
    <4c>   DW_AT_name        : (indirect string, offset: 0x316): unsigned char
 <1><50>: Abbrev Number: 3 (DW_TAG_base_type)
    <51>   DW_AT_byte_size   : 2
    <52>   DW_AT_encoding    : 7	(unsigned)
    <53>   DW_AT_name        : (indirect string, offset: 0x20e): short unsigned int
 <1><57>: Abbrev Number: 3 (DW_TAG_base_type)
    <58>   DW_AT_byte_size   : 1
    <59>   DW_AT_encoding    : 6	(signed char)
    <5a>   DW_AT_name        : (indirect string, offset: 0x318): signed char
 <1><5e>: Abbrev Number: 3 (DW_TAG_base_type)
    <5f>   DW_AT_byte_size   : 2
    <60>   DW_AT_encoding    : 5	(signed)
    <61>   DW_AT_name        : (indirect string, offset: 0x8): short int
 <1><65>: Abbrev Number: 2 (DW_TAG_typedef)
    <66>   DW_AT_name        : (indirect string, offset: 0x196): __uint16_t
    <6a>   DW_AT_decl_file   : 3
    <6b>   DW_AT_decl_line   : 40
    <6c>   DW_AT_decl_column : 28
    <6d>   DW_AT_type        : <0x50>
 <1><71>: Abbrev Number: 5 (DW_TAG_base_type)
    <72>   DW_AT_byte_size   : 4
    <73>   DW_AT_encoding    : 5	(signed)
    <74>   DW_AT_name        : int
 <1><78>: Abbrev Number: 2 (DW_TAG_typedef)
    <79>   DW_AT_name        : (indirect string, offset: 0x1a1): __uint32_t
    <7d>   DW_AT_decl_file   : 3
    <7e>   DW_AT_decl_line   : 42
    <7f>   DW_AT_decl_column : 22
    <80>   DW_AT_type        : <0x40>
 <1><84>: Abbrev Number: 3 (DW_TAG_base_type)
    <85>   DW_AT_byte_size   : 8
    <86>   DW_AT_encoding    : 5	(signed)
    <87>   DW_AT_name        : (indirect string, offset: 0x124): long int
 <1><8b>: Abbrev Number: 2 (DW_TAG_typedef)
    <8c>   DW_AT_name        : (indirect string, offset: 0x0): __off_t
    <90>   DW_AT_decl_file   : 3
    <91>   DW_AT_decl_line   : 152
    <92>   DW_AT_decl_column : 25
    <93>   DW_AT_type        : <0x84>
 <1><97>: Abbrev Number: 2 (DW_TAG_typedef)
    <98>   DW_AT_name        : (indirect string, offset: 0x3b8): __off64_t
    <9c>   DW_AT_decl_file   : 3
    <9d>   DW_AT_decl_line   : 153
    <9e>   DW_AT_decl_column : 27
    <9f>   DW_AT_type        : <0x84>
 <1><a3>: Abbrev Number: 2 (DW_TAG_typedef)
    <a4>   DW_AT_name        : (indirect string, offset: 0x324): __pid_t
    <a8>   DW_AT_decl_file   : 3
    <a9>   DW_AT_decl_line   : 154
    <aa>   DW_AT_decl_column : 25
    <ab>   DW_AT_type        : <0x71>
 <1><af>: Abbrev Number: 2 (DW_TAG_typedef)
    <b0>   DW_AT_name        : (indirect string, offset: 0x149): __ssize_t
    <b4>   DW_AT_decl_file   : 3
    <b5>   DW_AT_decl_line   : 194
    <b6>   DW_AT_decl_column : 27
    <b7>   DW_AT_type        : <0x84>
 <1><bb>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <bc>   DW_AT_byte_size   : 8
    <bd>   DW_AT_type        : <0xc1>
 <1><c1>: Abbrev Number: 3 (DW_TAG_base_type)
    <c2>   DW_AT_byte_size   : 1
    <c3>   DW_AT_encoding    : 6	(signed char)
    <c4>   DW_AT_name        : (indirect string, offset: 0x31f): char
 <1><c8>: Abbrev Number: 7 (DW_TAG_const_type)
    <c9>   DW_AT_type        : <0xc1>
 <1><cd>: Abbrev Number: 2 (DW_TAG_typedef)
    <ce>   DW_AT_name        : (indirect string, offset: 0x36c): __socklen_t
    <d2>   DW_AT_decl_file   : 3
    <d3>   DW_AT_decl_line   : 210
    <d4>   DW_AT_decl_column : 23
    <d5>   DW_AT_type        : <0x40>
 <1><d9>: Abbrev Number: 8 (DW_TAG_structure_type)
    <da>   DW_AT_name        : (indirect string, offset: 0x2c8): _IO_FILE
    <de>   DW_AT_byte_size   : 216
    <df>   DW_AT_decl_file   : 4
    <e0>   DW_AT_decl_line   : 49
    <e1>   DW_AT_decl_column : 8
    <e2>   DW_AT_sibling     : <0x260>
 <2><e6>: Abbrev Number: 9 (DW_TAG_member)
    <e7>   DW_AT_name        : (indirect string, offset: 0x142): _flags
    <eb>   DW_AT_decl_file   : 4
    <ec>   DW_AT_decl_line   : 51
    <ed>   DW_AT_decl_column : 7
    <ee>   DW_AT_type        : <0x71>
    <f2>   DW_AT_data_member_location: 0
 <2><f3>: Abbrev Number: 9 (DW_TAG_member)
    <f4>   DW_AT_name        : (indirect string, offset: 0x12): _IO_read_ptr
    <f8>   DW_AT_decl_file   : 4
    <f9>   DW_AT_decl_line   : 54
    <fa>   DW_AT_decl_column : 9
    <fb>   DW_AT_type        : <0xbb>
    <ff>   DW_AT_data_member_location: 8
 <2><100>: Abbrev Number: 9 (DW_TAG_member)
    <101>   DW_AT_name        : (indirect string, offset: 0x135): _IO_read_end
    <105>   DW_AT_decl_file   : 4
    <106>   DW_AT_decl_line   : 55
    <107>   DW_AT_decl_column : 9
    <108>   DW_AT_type        : <0xbb>
    <10c>   DW_AT_data_member_location: 16
 <2><10d>: Abbrev Number: 9 (DW_TAG_member)
    <10e>   DW_AT_name        : (indirect string, offset: 0x3c2): _IO_read_base
    <112>   DW_AT_decl_file   : 4
    <113>   DW_AT_decl_line   : 56
    <114>   DW_AT_decl_column : 9
    <115>   DW_AT_type        : <0xbb>
    <119>   DW_AT_data_member_location: 24
 <2><11a>: Abbrev Number: 9 (DW_TAG_member)
    <11b>   DW_AT_name        : (indirect string, offset: 0x4bf): _IO_write_base
    <11f>   DW_AT_decl_file   : 4
    <120>   DW_AT_decl_line   : 57
    <121>   DW_AT_decl_column : 9
    <122>   DW_AT_type        : <0xbb>
    <126>   DW_AT_data_member_location: 32
 <2><127>: Abbrev Number: 9 (DW_TAG_member)
    <128>   DW_AT_name        : (indirect string, offset: 0x1fb): _IO_write_ptr
    <12c>   DW_AT_decl_file   : 4
    <12d>   DW_AT_decl_line   : 58
    <12e>   DW_AT_decl_column : 9
    <12f>   DW_AT_type        : <0xbb>
    <133>   DW_AT_data_member_location: 40
 <2><134>: Abbrev Number: 9 (DW_TAG_member)
    <135>   DW_AT_name        : (indirect string, offset: 0x2a5): _IO_write_end
    <139>   DW_AT_decl_file   : 4
    <13a>   DW_AT_decl_line   : 59
    <13b>   DW_AT_decl_column : 9
    <13c>   DW_AT_type        : <0xbb>
    <140>   DW_AT_data_member_location: 48
 <2><141>: Abbrev Number: 9 (DW_TAG_member)
    <142>   DW_AT_name        : (indirect string, offset: 0xe3): _IO_buf_base
    <146>   DW_AT_decl_file   : 4
    <147>   DW_AT_decl_line   : 60
    <148>   DW_AT_decl_column : 9
    <149>   DW_AT_type        : <0xbb>
    <14d>   DW_AT_data_member_location: 56
 <2><14e>: Abbrev Number: 9 (DW_TAG_member)
    <14f>   DW_AT_name        : (indirect string, offset: 0x153): _IO_buf_end
    <153>   DW_AT_decl_file   : 4
    <154>   DW_AT_decl_line   : 61
    <155>   DW_AT_decl_column : 9
    <156>   DW_AT_type        : <0xbb>
    <15a>   DW_AT_data_member_location: 64
 <2><15b>: Abbrev Number: 9 (DW_TAG_member)
    <15c>   DW_AT_name        : (indirect string, offset: 0x23e): _IO_save_base
    <160>   DW_AT_decl_file   : 4
    <161>   DW_AT_decl_line   : 64
    <162>   DW_AT_decl_column : 9
    <163>   DW_AT_type        : <0xbb>
    <167>   DW_AT_data_member_location: 72
 <2><168>: Abbrev Number: 9 (DW_TAG_member)
    <169>   DW_AT_name        : (indirect string, offset: 0x456): _IO_backup_base
    <16d>   DW_AT_decl_file   : 4
    <16e>   DW_AT_decl_line   : 65
    <16f>   DW_AT_decl_column : 9
    <170>   DW_AT_type        : <0xbb>
    <174>   DW_AT_data_member_location: 80
 <2><175>: Abbrev Number: 9 (DW_TAG_member)
    <176>   DW_AT_name        : (indirect string, offset: 0x3d0): _IO_save_end
    <17a>   DW_AT_decl_file   : 4
    <17b>   DW_AT_decl_line   : 66
    <17c>   DW_AT_decl_column : 9
    <17d>   DW_AT_type        : <0xbb>
    <181>   DW_AT_data_member_location: 88
 <2><182>: Abbrev Number: 9 (DW_TAG_member)
    <183>   DW_AT_name        : (indirect string, offset: 0x34c): _markers
    <187>   DW_AT_decl_file   : 4
    <188>   DW_AT_decl_line   : 68
    <189>   DW_AT_decl_column : 22
    <18a>   DW_AT_type        : <0x279>
    <18e>   DW_AT_data_member_location: 96
 <2><18f>: Abbrev Number: 9 (DW_TAG_member)
    <190>   DW_AT_name        : (indirect string, offset: 0x1f): _chain
    <194>   DW_AT_decl_file   : 4
    <195>   DW_AT_decl_line   : 70
    <196>   DW_AT_decl_column : 20
    <197>   DW_AT_type        : <0x27f>
    <19b>   DW_AT_data_member_location: 104
 <2><19c>: Abbrev Number: 9 (DW_TAG_member)
    <19d>   DW_AT_name        : (indirect string, offset: 0x12d): _fileno
    <1a1>   DW_AT_decl_file   : 4
    <1a2>   DW_AT_decl_line   : 72
    <1a3>   DW_AT_decl_column : 7
    <1a4>   DW_AT_type        : <0x71>
    <1a8>   DW_AT_data_member_location: 112
 <2><1a9>: Abbrev Number: 9 (DW_TAG_member)
    <1aa>   DW_AT_name        : (indirect string, offset: 0x267): _flags2
    <1ae>   DW_AT_decl_file   : 4
    <1af>   DW_AT_decl_line   : 73
    <1b0>   DW_AT_decl_column : 7
    <1b1>   DW_AT_type        : <0x71>
    <1b5>   DW_AT_data_member_location: 116
 <2><1b6>: Abbrev Number: 9 (DW_TAG_member)
    <1b7>   DW_AT_name        : (indirect string, offset: 0x183): _old_offset
    <1bb>   DW_AT_decl_file   : 4
    <1bc>   DW_AT_decl_line   : 74
    <1bd>   DW_AT_decl_column : 11
    <1be>   DW_AT_type        : <0x8b>
    <1c2>   DW_AT_data_member_location: 120
 <2><1c3>: Abbrev Number: 9 (DW_TAG_member)
    <1c4>   DW_AT_name        : (indirect string, offset: 0x15f): _cur_column
    <1c8>   DW_AT_decl_file   : 4
    <1c9>   DW_AT_decl_line   : 77
    <1ca>   DW_AT_decl_column : 18
    <1cb>   DW_AT_type        : <0x50>
    <1cf>   DW_AT_data_member_location: 128
 <2><1d0>: Abbrev Number: 9 (DW_TAG_member)
    <1d1>   DW_AT_name        : (indirect string, offset: 0x338): _vtable_offset
    <1d5>   DW_AT_decl_file   : 4
    <1d6>   DW_AT_decl_line   : 78
    <1d7>   DW_AT_decl_column : 15
    <1d8>   DW_AT_type        : <0x57>
    <1dc>   DW_AT_data_member_location: 130
 <2><1dd>: Abbrev Number: 9 (DW_TAG_member)
    <1de>   DW_AT_name        : (indirect string, offset: 0xd3): _shortbuf
    <1e2>   DW_AT_decl_file   : 4
    <1e3>   DW_AT_decl_line   : 79
    <1e4>   DW_AT_decl_column : 8
    <1e5>   DW_AT_type        : <0x285>
    <1e9>   DW_AT_data_member_location: 131
 <2><1ea>: Abbrev Number: 9 (DW_TAG_member)
    <1eb>   DW_AT_name        : (indirect string, offset: 0x261): _lock
    <1ef>   DW_AT_decl_file   : 4
    <1f0>   DW_AT_decl_line   : 81
    <1f1>   DW_AT_decl_column : 15
    <1f2>   DW_AT_type        : <0x295>
    <1f6>   DW_AT_data_member_location: 136
 <2><1f7>: Abbrev Number: 9 (DW_TAG_member)
    <1f8>   DW_AT_name        : (indirect string, offset: 0x187): _offset
    <1fc>   DW_AT_decl_file   : 4
    <1fd>   DW_AT_decl_line   : 89
    <1fe>   DW_AT_decl_column : 13
    <1ff>   DW_AT_type        : <0x97>
    <203>   DW_AT_data_member_location: 144
 <2><204>: Abbrev Number: 9 (DW_TAG_member)
    <205>   DW_AT_name        : (indirect string, offset: 0x17a): _codecvt
    <209>   DW_AT_decl_file   : 4
    <20a>   DW_AT_decl_line   : 91
    <20b>   DW_AT_decl_column : 23
    <20c>   DW_AT_type        : <0x2a0>
    <210>   DW_AT_data_member_location: 152
 <2><211>: Abbrev Number: 9 (DW_TAG_member)
    <212>   DW_AT_name        : (indirect string, offset: 0x4a0): _wide_data
    <216>   DW_AT_decl_file   : 4
    <217>   DW_AT_decl_line   : 92
    <218>   DW_AT_decl_column : 25
    <219>   DW_AT_type        : <0x2ab>
    <21d>   DW_AT_data_member_location: 160
 <2><21e>: Abbrev Number: 9 (DW_TAG_member)
    <21f>   DW_AT_name        : (indirect string, offset: 0x486): _freeres_list
    <223>   DW_AT_decl_file   : 4
    <224>   DW_AT_decl_line   : 93
    <225>   DW_AT_decl_column : 20
    <226>   DW_AT_type        : <0x27f>
    <22a>   DW_AT_data_member_location: 168
 <2><22b>: Abbrev Number: 9 (DW_TAG_member)
    <22c>   DW_AT_name        : (indirect string, offset: 0x1d6): _freeres_buf
    <230>   DW_AT_decl_file   : 4
    <231>   DW_AT_decl_line   : 94
    <232>   DW_AT_decl_column : 9
    <233>   DW_AT_type        : <0x47>
    <237>   DW_AT_data_member_location: 176
 <2><238>: Abbrev Number: 9 (DW_TAG_member)
    <239>   DW_AT_name        : (indirect string, offset: 0x3f6): __pad5
    <23d>   DW_AT_decl_file   : 4
    <23e>   DW_AT_decl_line   : 95
    <23f>   DW_AT_decl_column : 10
    <240>   DW_AT_type        : <0x2d>
    <244>   DW_AT_data_member_location: 184
 <2><245>: Abbrev Number: 9 (DW_TAG_member)
    <246>   DW_AT_name        : (indirect string, offset: 0x26f): _mode
    <24a>   DW_AT_decl_file   : 4
    <24b>   DW_AT_decl_line   : 96
    <24c>   DW_AT_decl_column : 7
    <24d>   DW_AT_type        : <0x71>
    <251>   DW_AT_data_member_location: 192
 <2><252>: Abbrev Number: 9 (DW_TAG_member)
    <253>   DW_AT_name        : (indirect string, offset: 0x409): _unused2
    <257>   DW_AT_decl_file   : 4
    <258>   DW_AT_decl_line   : 98
    <259>   DW_AT_decl_column : 8
    <25a>   DW_AT_type        : <0x2b1>
    <25e>   DW_AT_data_member_location: 196
 <2><25f>: Abbrev Number: 0
 <1><260>: Abbrev Number: 2 (DW_TAG_typedef)
    <261>   DW_AT_name        : (indirect string, offset: 0x2cc): FILE
    <265>   DW_AT_decl_file   : 5
    <266>   DW_AT_decl_line   : 7
    <267>   DW_AT_decl_column : 25
    <268>   DW_AT_type        : <0xd9>
 <1><26c>: Abbrev Number: 10 (DW_TAG_typedef)
    <26d>   DW_AT_name        : (indirect string, offset: 0x2bd): _IO_lock_t
    <271>   DW_AT_decl_file   : 4
    <272>   DW_AT_decl_line   : 43
    <273>   DW_AT_decl_column : 14
 <1><274>: Abbrev Number: 11 (DW_TAG_structure_type)
    <275>   DW_AT_name        : (indirect string, offset: 0x1bb): _IO_marker
    <279>   DW_AT_declaration : 1
 <1><279>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <27a>   DW_AT_byte_size   : 8
    <27b>   DW_AT_type        : <0x274>
 <1><27f>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <280>   DW_AT_byte_size   : 8
    <281>   DW_AT_type        : <0xd9>
 <1><285>: Abbrev Number: 12 (DW_TAG_array_type)
    <286>   DW_AT_type        : <0xc1>
    <28a>   DW_AT_sibling     : <0x295>
 <2><28e>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <28f>   DW_AT_type        : <0x39>
    <293>   DW_AT_upper_bound : 0
 <2><294>: Abbrev Number: 0
 <1><295>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <296>   DW_AT_byte_size   : 8
    <297>   DW_AT_type        : <0x26c>
 <1><29b>: Abbrev Number: 11 (DW_TAG_structure_type)
    <29c>   DW_AT_name        : (indirect string, offset: 0x177): _IO_codecvt
    <2a0>   DW_AT_declaration : 1
 <1><2a0>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <2a1>   DW_AT_byte_size   : 8
    <2a2>   DW_AT_type        : <0x29b>
 <1><2a6>: Abbrev Number: 11 (DW_TAG_structure_type)
    <2a7>   DW_AT_name        : (indirect string, offset: 0x49d): _IO_wide_data
    <2ab>   DW_AT_declaration : 1
 <1><2ab>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <2ac>   DW_AT_byte_size   : 8
    <2ad>   DW_AT_type        : <0x2a6>
 <1><2b1>: Abbrev Number: 12 (DW_TAG_array_type)
    <2b2>   DW_AT_type        : <0xc1>
    <2b6>   DW_AT_sibling     : <0x2c1>
 <2><2ba>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <2bb>   DW_AT_type        : <0x39>
    <2bf>   DW_AT_upper_bound : 19
 <2><2c0>: Abbrev Number: 0
 <1><2c1>: Abbrev Number: 2 (DW_TAG_typedef)
    <2c2>   DW_AT_name        : (indirect string, offset: 0x14b): ssize_t
    <2c6>   DW_AT_decl_file   : 6
    <2c7>   DW_AT_decl_line   : 77
    <2c8>   DW_AT_decl_column : 19
    <2c9>   DW_AT_type        : <0xaf>
 <1><2cd>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <2ce>   DW_AT_byte_size   : 8
    <2cf>   DW_AT_type        : <0x260>
 <1><2d3>: Abbrev Number: 14 (DW_TAG_restrict_type)
    <2d4>   DW_AT_type        : <0x2cd>
 <1><2d8>: Abbrev Number: 15 (DW_TAG_variable)
    <2d9>   DW_AT_name        : (indirect string, offset: 0x412): stderr
    <2dd>   DW_AT_decl_file   : 6
    <2de>   DW_AT_decl_line   : 145
    <2df>   DW_AT_decl_column : 14
    <2e0>   DW_AT_type        : <0x2cd>
    <2e4>   DW_AT_external    : 1
    <2e4>   DW_AT_declaration : 1
 <1><2e4>: Abbrev Number: 16 (DW_TAG_typedef)
    <2e5>   DW_AT_name        : (indirect string, offset: 0x36e): socklen_t
    <2e9>   DW_AT_decl_file   : 7
    <2ea>   DW_AT_decl_line   : 274
    <2ec>   DW_AT_decl_column : 21
    <2ed>   DW_AT_type        : <0xcd>
 <1><2f1>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <2f2>   DW_AT_byte_size   : 8
    <2f3>   DW_AT_type        : <0xbb>
 <1><2f7>: Abbrev Number: 3 (DW_TAG_base_type)
    <2f8>   DW_AT_byte_size   : 8
    <2f9>   DW_AT_encoding    : 5	(signed)
    <2fa>   DW_AT_name        : (indirect string, offset: 0x11f): long long int
 <1><2fe>: Abbrev Number: 3 (DW_TAG_base_type)
    <2ff>   DW_AT_byte_size   : 8
    <300>   DW_AT_encoding    : 7	(unsigned)
    <301>   DW_AT_name        : (indirect string, offset: 0xfe): long long unsigned int
 <1><305>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <306>   DW_AT_byte_size   : 8
    <307>   DW_AT_type        : <0x30b>
 <1><30b>: Abbrev Number: 17 (DW_TAG_const_type)
 <1><30c>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <30d>   DW_AT_byte_size   : 8
    <30e>   DW_AT_type        : <0xc8>
 <1><312>: Abbrev Number: 14 (DW_TAG_restrict_type)
    <313>   DW_AT_type        : <0x30c>
 <1><317>: Abbrev Number: 2 (DW_TAG_typedef)
    <318>   DW_AT_name        : (indirect string, offset: 0x198): uint16_t
    <31c>   DW_AT_decl_file   : 8
    <31d>   DW_AT_decl_line   : 25
    <31e>   DW_AT_decl_column : 20
    <31f>   DW_AT_type        : <0x65>
 <1><323>: Abbrev Number: 2 (DW_TAG_typedef)
    <324>   DW_AT_name        : (indirect string, offset: 0x1a3): uint32_t
    <328>   DW_AT_decl_file   : 8
    <329>   DW_AT_decl_line   : 26
    <32a>   DW_AT_decl_column : 20
    <32b>   DW_AT_type        : <0x78>
 <1><32f>: Abbrev Number: 18 (DW_TAG_enumeration_type)
    <330>   DW_AT_name        : (indirect string, offset: 0x303): __socket_type
    <334>   DW_AT_encoding    : 7	(unsigned)
    <335>   DW_AT_byte_size   : 4
    <336>   DW_AT_type        : <0x40>
    <33a>   DW_AT_decl_file   : 17
    <33b>   DW_AT_decl_line   : 24
    <33c>   DW_AT_decl_column : 6
    <33d>   DW_AT_sibling     : <0x37c>
 <2><341>: Abbrev Number: 19 (DW_TAG_enumerator)
    <342>   DW_AT_name        : (indirect string, offset: 0x16b): SOCK_STREAM
    <346>   DW_AT_const_value : 1
 <2><347>: Abbrev Number: 19 (DW_TAG_enumerator)
    <348>   DW_AT_name        : (indirect string, offset: 0x434): SOCK_DGRAM
    <34c>   DW_AT_const_value : 2
 <2><34d>: Abbrev Number: 19 (DW_TAG_enumerator)
    <34e>   DW_AT_name        : (indirect string, offset: 0x494): SOCK_RAW
    <352>   DW_AT_const_value : 3
 <2><353>: Abbrev Number: 19 (DW_TAG_enumerator)
    <354>   DW_AT_name        : (indirect string, offset: 0x1c6): SOCK_RDM
    <358>   DW_AT_const_value : 4
 <2><359>: Abbrev Number: 19 (DW_TAG_enumerator)
    <35a>   DW_AT_name        : (indirect string, offset: 0x4ab): SOCK_SEQPACKET
    <35e>   DW_AT_const_value : 5
 <2><35f>: Abbrev Number: 19 (DW_TAG_enumerator)
    <360>   DW_AT_name        : (indirect string, offset: 0x2d1): SOCK_DCCP
    <364>   DW_AT_const_value : 6
 <2><365>: Abbrev Number: 19 (DW_TAG_enumerator)
    <366>   DW_AT_name        : (indirect string, offset: 0x355): SOCK_PACKET
    <36a>   DW_AT_const_value : 10
 <2><36b>: Abbrev Number: 20 (DW_TAG_enumerator)
    <36c>   DW_AT_name        : (indirect string, offset: 0x41e): SOCK_CLOEXEC
    <370>   DW_AT_const_value : 0x80000
 <2><374>: Abbrev Number: 21 (DW_TAG_enumerator)
    <375>   DW_AT_name        : (indirect string, offset: 0xf0): SOCK_NONBLOCK
    <379>   DW_AT_const_value : 2048
 <2><37b>: Abbrev Number: 0
 <1><37c>: Abbrev Number: 2 (DW_TAG_typedef)
    <37d>   DW_AT_name        : (indirect string, offset: 0x3fd): sa_family_t
    <381>   DW_AT_decl_file   : 9
    <382>   DW_AT_decl_line   : 28
    <383>   DW_AT_decl_column : 28
    <384>   DW_AT_type        : <0x50>
 <1><388>: Abbrev Number: 8 (DW_TAG_structure_type)
    <389>   DW_AT_name        : (indirect string, offset: 0x42b): sockaddr
    <38d>   DW_AT_byte_size   : 16
    <38e>   DW_AT_decl_file   : 10
    <38f>   DW_AT_decl_line   : 180
    <390>   DW_AT_decl_column : 8
    <391>   DW_AT_sibling     : <0x3b0>
 <2><395>: Abbrev Number: 9 (DW_TAG_member)
    <396>   DW_AT_name        : (indirect string, offset: 0x2e4): sa_family
    <39a>   DW_AT_decl_file   : 10
    <39b>   DW_AT_decl_line   : 182
    <39c>   DW_AT_decl_column : 5
    <39d>   DW_AT_type        : <0x37c>
    <3a1>   DW_AT_data_member_location: 0
 <2><3a2>: Abbrev Number: 9 (DW_TAG_member)
    <3a3>   DW_AT_name        : (indirect string, offset: 0x47e): sa_data
    <3a7>   DW_AT_decl_file   : 10
    <3a8>   DW_AT_decl_line   : 183
    <3a9>   DW_AT_decl_column : 10
    <3aa>   DW_AT_type        : <0x3b5>
    <3ae>   DW_AT_data_member_location: 2
 <2><3af>: Abbrev Number: 0
 <1><3b0>: Abbrev Number: 7 (DW_TAG_const_type)
    <3b1>   DW_AT_type        : <0x388>
 <1><3b5>: Abbrev Number: 12 (DW_TAG_array_type)
    <3b6>   DW_AT_type        : <0xc1>
    <3ba>   DW_AT_sibling     : <0x3c5>
 <2><3be>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <3bf>   DW_AT_type        : <0x39>
    <3c3>   DW_AT_upper_bound : 13
 <2><3c4>: Abbrev Number: 0
 <1><3c5>: Abbrev Number: 2 (DW_TAG_typedef)
    <3c6>   DW_AT_name        : (indirect string, offset: 0x115): in_addr_t
    <3ca>   DW_AT_decl_file   : 11
    <3cb>   DW_AT_decl_line   : 30
    <3cc>   DW_AT_decl_column : 18
    <3cd>   DW_AT_type        : <0x323>
 <1><3d1>: Abbrev Number: 8 (DW_TAG_structure_type)
    <3d2>   DW_AT_name        : (indirect string, offset: 0x222): in_addr
    <3d6>   DW_AT_byte_size   : 4
    <3d7>   DW_AT_decl_file   : 11
    <3d8>   DW_AT_decl_line   : 31
    <3d9>   DW_AT_decl_column : 8
    <3da>   DW_AT_sibling     : <0x3ec>
 <2><3de>: Abbrev Number: 9 (DW_TAG_member)
    <3df>   DW_AT_name        : (indirect string, offset: 0x1cf): s_addr
    <3e3>   DW_AT_decl_file   : 11
    <3e4>   DW_AT_decl_line   : 33
    <3e5>   DW_AT_decl_column : 15
    <3e6>   DW_AT_type        : <0x3c5>
    <3ea>   DW_AT_data_member_location: 0
 <2><3eb>: Abbrev Number: 0
 <1><3ec>: Abbrev Number: 2 (DW_TAG_typedef)
    <3ed>   DW_AT_name        : (indirect string, offset: 0x4ce): in_port_t
    <3f1>   DW_AT_decl_file   : 11
    <3f2>   DW_AT_decl_line   : 123
    <3f3>   DW_AT_decl_column : 18
    <3f4>   DW_AT_type        : <0x317>
 <1><3f8>: Abbrev Number: 8 (DW_TAG_structure_type)
    <3f9>   DW_AT_name        : (indirect string, offset: 0x44a): sockaddr_in
    <3fd>   DW_AT_byte_size   : 16
    <3fe>   DW_AT_decl_file   : 11
    <3ff>   DW_AT_decl_line   : 245
    <400>   DW_AT_decl_column : 8
    <401>   DW_AT_sibling     : <0x43a>
 <2><405>: Abbrev Number: 9 (DW_TAG_member)
    <406>   DW_AT_name        : (indirect string, offset: 0x290): sin_family
    <40a>   DW_AT_decl_file   : 11
    <40b>   DW_AT_decl_line   : 247
    <40c>   DW_AT_decl_column : 5
    <40d>   DW_AT_type        : <0x37c>
    <411>   DW_AT_data_member_location: 0
 <2><412>: Abbrev Number: 9 (DW_TAG_member)
    <413>   DW_AT_name        : (indirect string, offset: 0x2db): sin_port
    <417>   DW_AT_decl_file   : 11
    <418>   DW_AT_decl_line   : 248
    <419>   DW_AT_decl_column : 15
    <41a>   DW_AT_type        : <0x3ec>
    <41e>   DW_AT_data_member_location: 2
 <2><41f>: Abbrev Number: 9 (DW_TAG_member)
    <420>   DW_AT_name        : (indirect string, offset: 0x221): sin_addr
    <424>   DW_AT_decl_file   : 11
    <425>   DW_AT_decl_line   : 249
    <426>   DW_AT_decl_column : 20
    <427>   DW_AT_type        : <0x3d1>
    <42b>   DW_AT_data_member_location: 4
 <2><42c>: Abbrev Number: 9 (DW_TAG_member)
    <42d>   DW_AT_name        : (indirect string, offset: 0x1b2): sin_zero
    <431>   DW_AT_decl_file   : 11
    <432>   DW_AT_decl_line   : 252
    <433>   DW_AT_decl_column : 19
    <434>   DW_AT_type        : <0x43a>
    <438>   DW_AT_data_member_location: 8
 <2><439>: Abbrev Number: 0
 <1><43a>: Abbrev Number: 12 (DW_TAG_array_type)
    <43b>   DW_AT_type        : <0x49>
    <43f>   DW_AT_sibling     : <0x44a>
 <2><443>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <444>   DW_AT_type        : <0x39>
    <448>   DW_AT_upper_bound : 7
 <2><449>: Abbrev Number: 0
 <1><44a>: Abbrev Number: 8 (DW_TAG_structure_type)
    <44b>   DW_AT_name        : (indirect string, offset: 0x378): hostent
    <44f>   DW_AT_byte_size   : 32
    <450>   DW_AT_decl_file   : 12
    <451>   DW_AT_decl_line   : 98
    <452>   DW_AT_decl_column : 8
    <453>   DW_AT_sibling     : <0x499>
 <2><457>: Abbrev Number: 9 (DW_TAG_member)
    <458>   DW_AT_name        : (indirect string, offset: 0x1f4): h_name
    <45c>   DW_AT_decl_file   : 12
    <45d>   DW_AT_decl_line   : 100
    <45e>   DW_AT_decl_column : 9
    <45f>   DW_AT_type        : <0xbb>
    <463>   DW_AT_data_member_location: 0
 <2><464>: Abbrev Number: 9 (DW_TAG_member)
    <465>   DW_AT_name        : (indirect string, offset: 0x2b3): h_aliases
    <469>   DW_AT_decl_file   : 12
    <46a>   DW_AT_decl_line   : 101
    <46b>   DW_AT_decl_column : 10
    <46c>   DW_AT_type        : <0x2f1>
    <470>   DW_AT_data_member_location: 8
 <2><471>: Abbrev Number: 9 (DW_TAG_member)
    <472>   DW_AT_name        : (indirect string, offset: 0x24c): h_addrtype
    <476>   DW_AT_decl_file   : 12
    <477>   DW_AT_decl_line   : 102
    <478>   DW_AT_decl_column : 7
    <479>   DW_AT_type        : <0x71>
    <47d>   DW_AT_data_member_location: 16
 <2><47e>: Abbrev Number: 9 (DW_TAG_member)
    <47f>   DW_AT_name        : (indirect string, offset: 0x2ee): h_length
    <483>   DW_AT_decl_file   : 12
    <484>   DW_AT_decl_line   : 103
    <485>   DW_AT_decl_column : 7
    <486>   DW_AT_type        : <0x71>
    <48a>   DW_AT_data_member_location: 20
 <2><48b>: Abbrev Number: 9 (DW_TAG_member)
    <48c>   DW_AT_name        : (indirect string, offset: 0x2f7): h_addr_list
    <490>   DW_AT_decl_file   : 12
    <491>   DW_AT_decl_line   : 104
    <492>   DW_AT_decl_column : 10
    <493>   DW_AT_type        : <0x2f1>
    <497>   DW_AT_data_member_location: 24
 <2><498>: Abbrev Number: 0
 <1><499>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <49a>   DW_AT_byte_size   : 8
    <49b>   DW_AT_type        : <0x388>
 <1><49f>: Abbrev Number: 14 (DW_TAG_restrict_type)
    <4a0>   DW_AT_type        : <0x499>
 <1><4a4>: Abbrev Number: 22 (DW_TAG_subprogram)
    <4a5>   DW_AT_external    : 1
    <4a5>   DW_AT_name        : (indirect string, offset: 0xdd): close
    <4a9>   DW_AT_decl_file   : 7
    <4aa>   DW_AT_decl_line   : 358
    <4ac>   DW_AT_decl_column : 12
    <4ad>   DW_AT_prototyped  : 1
    <4ad>   DW_AT_type        : <0x71>
    <4b1>   DW_AT_declaration : 1
    <4b1>   DW_AT_sibling     : <0x4bb>
 <2><4b5>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <4b6>   DW_AT_type        : <0x71>
 <2><4ba>: Abbrev Number: 0
 <1><4bb>: Abbrev Number: 22 (DW_TAG_subprogram)
    <4bc>   DW_AT_external    : 1
    <4bc>   DW_AT_name        : (indirect string, offset: 0x27c): write
    <4c0>   DW_AT_decl_file   : 7
    <4c1>   DW_AT_decl_line   : 378
    <4c3>   DW_AT_decl_column : 16
    <4c4>   DW_AT_prototyped  : 1
    <4c4>   DW_AT_type        : <0x2c1>
    <4c8>   DW_AT_declaration : 1
    <4c8>   DW_AT_sibling     : <0x4dc>
 <2><4cc>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <4cd>   DW_AT_type        : <0x71>
 <2><4d1>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <4d2>   DW_AT_type        : <0x305>
 <2><4d6>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <4d7>   DW_AT_type        : <0x2d>
 <2><4db>: Abbrev Number: 0
 <1><4dc>: Abbrev Number: 22 (DW_TAG_subprogram)
    <4dd>   DW_AT_external    : 1
    <4dd>   DW_AT_name        : (indirect string, offset: 0x230): strlen
    <4e1>   DW_AT_decl_file   : 13
    <4e2>   DW_AT_decl_line   : 407
    <4e4>   DW_AT_decl_column : 15
    <4e5>   DW_AT_prototyped  : 1
    <4e5>   DW_AT_type        : <0x2d>
    <4e9>   DW_AT_declaration : 1
    <4e9>   DW_AT_sibling     : <0x4f3>
 <2><4ed>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <4ee>   DW_AT_type        : <0x30c>
 <2><4f2>: Abbrev Number: 0
 <1><4f3>: Abbrev Number: 24 (DW_TAG_subprogram)
    <4f4>   DW_AT_external    : 1
    <4f4>   DW_AT_name        : (indirect string, offset: 0x2d): strcmp
    <4f8>   DW_AT_decl_file   : 13
    <4f9>   DW_AT_decl_line   : 156
    <4fa>   DW_AT_decl_column : 12
    <4fb>   DW_AT_prototyped  : 1
    <4fb>   DW_AT_type        : <0x71>
    <4ff>   DW_AT_declaration : 1
    <4ff>   DW_AT_sibling     : <0x50e>
 <2><503>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <504>   DW_AT_type        : <0x30c>
 <2><508>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <509>   DW_AT_type        : <0x30c>
 <2><50d>: Abbrev Number: 0
 <1><50e>: Abbrev Number: 22 (DW_TAG_subprogram)
    <50f>   DW_AT_external    : 1
    <50f>   DW_AT_name        : (indirect string, offset: 0x474): read
    <513>   DW_AT_decl_file   : 7
    <514>   DW_AT_decl_line   : 371
    <516>   DW_AT_decl_column : 16
    <517>   DW_AT_prototyped  : 1
    <517>   DW_AT_type        : <0x2c1>
    <51b>   DW_AT_declaration : 1
    <51b>   DW_AT_sibling     : <0x52f>
 <2><51f>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <520>   DW_AT_type        : <0x71>
 <2><524>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <525>   DW_AT_type        : <0x47>
 <2><529>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <52a>   DW_AT_type        : <0x2d>
 <2><52e>: Abbrev Number: 0
 <1><52f>: Abbrev Number: 24 (DW_TAG_subprogram)
    <530>   DW_AT_external    : 1
    <530>   DW_AT_name        : (indirect string, offset: 0x380): inet_ntoa
    <534>   DW_AT_decl_file   : 14
    <535>   DW_AT_decl_line   : 53
    <536>   DW_AT_decl_column : 14
    <537>   DW_AT_prototyped  : 1
    <537>   DW_AT_type        : <0xbb>
    <53b>   DW_AT_declaration : 1
    <53b>   DW_AT_sibling     : <0x545>
 <2><53f>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <540>   DW_AT_type        : <0x3d1>
